In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame(np.arange(12).reshape(3, 4),
                    columns=['A', 'B', 'C', 'D'])
df

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [3]:
df.drop([0,2])

   A  B  C  D
1  4  5  6  7

In [5]:
df.drop(columns=['B', 'C'])

   A   D
0  0   3
1  4   7
2  8  11

In [6]:
df = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                  'k2': [1, 1, 2, 3, 3, 4, 4]})
df

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [7]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [8]:
df.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [9]:
df['v1'] = range(7)
df

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [10]:
df.drop_duplicates(['k1','k2'])

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5

<p>با آن که ردیف‌های شماره‌ی ۵ و ۶ کاملاً مشابه هم نبودند اما به دلیل تشابه دو ستون اول حذف می‌شوند. همان‌طور که می‌بینید در این حالت این که کدام داده حذف شود لزوماً واضح نیست. برای مشخص کردن این که کدام داده حذف نشود، می‌توانیم آرگومان keep در تابع drop_duplicates را تغییر دهیم. به‌طور پیش‌فرض این مقدار برابر 'first' است؛ به این معنا که از بین دو مقدار مشابه تنها اولی را نگه می‌داریم. همچنین می‌توان آن‌ را به 'last' برای نگه داشتن داده‌ی دیگر یا False برای حذف هر دو داده تغییر داد.</p>

In [11]:
df.drop_duplicates(['k1','k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6